{
	"commands.category": "Live Preview",
	"commands.startServer": "Start Server",
	"commands.showPreview": "Show Preview",
	"commands.showDebugPreview": "Show Debug Preview",
	"commands.showPreviewExternalBrowser": "Show Preview (External Browser)",
	"commands.showDebugPreviewExternalBrowser": "Show Debug Preview (External Browser)",
	"commands.showPreviewInternalBrowser": "Show Preview (Internal Browser)",
	"commands.openAutomaticallyOnServerStart": "Open Automatically on Server Start",
	"commands.runServerLoggingTask": "Start Server Logging",
	"commands.stopServer": "Stop Server",
	"commands.startServerAtFileString": "Start Server at File Path String",
	"settings.portNumber": "Which local port the live preview's server should try initially. If this port number doesn't work, it will increment the port number until it finds a free port.",
	"settings.serverKeepAliveAfterEmbeddedPreviewClose": "How many minutes after closing the embedded preview you want the server to shut off. Set to 0 to have server stay on indefinetely.",
	"settings.previewDebounceDelay": "How many milliseconds delay to use when debouncing the preview update.",
	"settings.showServerStatusNotifications": "Whether or not to show information messages on server on/off status change.",
	"settings.autoRefreshPreview": "How often to automatically refresh the preview.",
	"settings.openPreviewTarget": "The preferred target for previews.",
	"settings.notifyOnOpenLooseFile": "Whether to notify the user when opening a preview for a file that is not part of the currently opened workspace (or the workspace where the server is hosted).",
	"settings.tasks.runTaskWithExternalPreview": "Whether or not to pair external preview instances with the auto-generated server task. When disabled, the server will also not automatically close (until the window is closed).",
	"settings.defaultPreviewPath": "The file to automatically show upon starting the server. Leave blank to open at the index.",
	"settings.debugOnExternalPreview": "Whether or not to attach the JavaScript debugger on external preview launches.",
	"settings.serverRoot": "The relative path from the workspace root that the files are served from. Files will be previewed as if the workspace root is at this relative path. If this directory path doesn't exist in your workspace, it will default to the workspace root. This setting only applies if you have a workspace open.",
	"settings.hostIP": "The local IP host address to host your files on.",
	"settings.customExternalBrowser": "The browser you want to launch when previewing a file in an external browser. Only works for normal preview (non-debug) and only works on desktop.",
	"settings.httpHeaders": "The extra HTTP headers that should be set in the server's HTTP responses.",
	"tasks.workspacePathDesc": "The path for the workspace that you want to start the server in."
}